*&---------------------------------------------------------------------*
*& Report ZDTYPE_EX05
*&---------------------------------------------------------------------*
*&
*&---------------------------------------------------------------------*
REPORT ZDTYPE_EX05.
*--------------------------------------------------------------------*
*1. 전역 테이블 타입 사용
*--------------------------------------------------------------------*

" 원래는 types를 사용해서 테이블에 대한 구조체를 만들어서 사용했다면 이제는 se11에서 만든 테이블을
" 전역으로 사용해본다.
data : gt_mat type ztt_mat_cbo, "se11에서 만든 전력 테이블 타입
       gs_mat type line of ztt_mat_cbo. "라인 타입(한줄)

*--------------------------------------------------------------------*
* 2. 데이터 추가
*--------------------------------------------------------------------*
gs_mat-matnr = 'Z1001'.
gs_mat-mtart = 'FERT'.
gs_mat-matdesc = '이지 아밥 교재'.
gs_mat-price = '125.50'.
Append gs_mat to gt_mat.

gs_mat-matnr = 'Z1002'.
gs_mat-mtart = 'EXP1'.
gs_mat-matdesc = '이지 아밥 교재2'.
gs_mat-price = '120.22'.
append gs_mat to gt_mat.

gs_mat-matnr = 'Z1003'.
gs_mat-mtart = 'EXP2'.
gs_mat-matdesc = '이지 아밥 교재3'.
gs_mat-price = '100.22'.
append gs_mat to gt_mat.

*--------------------------------------------------------------------*
*3. Loop 출력하기
*--------------------------------------------------------------------*
WRITE : / '--------------------------------'.
WRITE : / '자재코드', 10 '자재유형',  25 '자재명', 50 '단가',
        / '--------------------------------/'.

Loop at gt_mat into gs_mat.
  WRITE: / gs_mat-matnr, 10 gs_mat-mtart,
  25 gs_mat-matdesc, 50 gs_mat-price.
endloop.

WRITE: / '----------------------------------'.


*--------------------------------------------------------------------*
*4. 총 건수 출력
*--------------------------------------------------------------------*
data gv_lines type i.
DESCRIBE TABLE gt_mat lines gv_lines.
WRITE: / '총 자재 건수:', gv_lines.
