*&---------------------------------------------------------------------*
*& Include          ZMAIN_F01
*&---------------------------------------------------------------------*
*&---------------------------------------------------------------------*
*& Form CALC_TOTAL
*&---------------------------------------------------------------------*
*& text
*&---------------------------------------------------------------------*
*& -->  p1        text
*& <--  p2        text
*&---------------------------------------------------------------------*
FORM calc_total .

*  gv_total = gv_price * gv_qty.
*  WRITE : / '출력 :', gv_total.

  " 위 처럼 할 수도 있지만 함수 모듈을 만들어서 코드를 재사용할 수 있게 할 수 있다
  CALL FUNCTION 'Z_CALC_TOTAL'
    EXPORTING
      iv_price = gv_price
      iv_qty   = gv_qty
    IMPORTING
      ev_total = gv_total.

  WRITE : / '총액:', gv_total.

ENDFORM.
